#pragma once
#include "source2sdk/server/CPointEntity.hpp"
#include "source2sdk/source2gen.hpp"
#include <cstddef>
#include <cstdint>

// /////////////////////////////////////////////////////////////
// Module: server
// Created using source2gen - github.com/neverlosecc/source2gen
// /////////////////////////////////////////////////////////////

namespace source2sdk::server
{
    // Registered alignment: 0x8
    // Alignment: 0x8
    // Standard-layout class: false
    // Size: 0x4e0
    // Has VTable
    // Construct allowed
    // MClassHasEntityLimitedDataDesc
    // MNetworkAssumeNotNetworkable
    #pragma pack(push, 1)
    class CMapInfo : public server::CPointEntity
    {
    public:
        int32_t m_iBuyingStatus; // 0x4c0        
        float m_flBombRadius; // 0x4c4        
        int32_t m_iPetPopulation; // 0x4c8        
        bool m_bUseNormalSpawnsForDM; // 0x4cc        
        bool m_bDisableAutoGeneratedDMSpawns; // 0x4cd        
        [[maybe_unused]] std::uint8_t pad_0x4ce[0x2]; // 0x4ce
        float m_flBotMaxVisionDistance; // 0x4d0        
        int32_t m_iHostageCount; // 0x4d4        
        bool m_bFadePlayerVisibilityFarZ; // 0x4d8        
        [[maybe_unused]] std::uint8_t pad_0x4d9[0x7];
        
        // Datamap fields:
        // int32_t InputFireWinCondition; // 0x0
    };
    #pragma pack(pop)
    
    // Cannot assert offsets of fields in CMapInfo because it is not a standard-layout class
    static_assert(sizeof(CMapInfo) == 0x4e0);
};
